import os
import sys
import random

G_MAJOR_VERSION = 0
G_MINOR_VERSION = 6

G_DEFINE_DEBUG_MODE = True
G_DEFINE_EVENT_MODE = False

G_THREAD_READ_8 = 0
G_THREAD_READ_4 = 1
G_THREAD_READ_5 = 2
G_THREAD_READ_4_5 = 3


def resource_path(file_name, detail_path):
    if hasattr(sys, '_MEIPASS'):
        return os.path.join(sys._MEIPASS, file_name)
    return os.path.dirname(os.path.abspath(__file__)) + detail_path + file_name


G_GSPREAD_URL = 'https://docs.google.com/spreadsheets/d/1DI5VKpTVu96r4gdvGvTeQOA5GArmhT-uUFDIR4fmdi0/edit#gid=352469473'

G_CHAMPION = ["가렌", "갈리오", "갱플랭크", "그라가스", "그레이브즈", "그웬", "나르", "나미", "나서스", "노틸러스", "녹턴", "누누", "니달리", "니코", "다리우스",
              "다이애나", "드레이븐",
              "라이즈", "라칸", "람머스", "럭스", "럼블", "레나타글라스크", "레넥톤", "레오나", "렉사이", "렐", "렝가", "루시안", "룰루", "르블랑", "리븐",
              "리산드라", "리신", "릴리아",
              "마스터이", "마오카이", "말자하", "말파이트", "모데카이저", "모르가나", "문도박사", "미스포츈", "바드", "바루스", "바이", "베이가", "베인", "벡스",
              "벨코즈", "볼리베어",
              "브라움", "브랜드", "블라디미르", "블리츠크랭크", "비에고", "빅토르", "뽀삐", "사미라", "사이온", "사일러스", "샤코", "세나", "세라핀", "세주아니",
              "세트", "소나", "소라카",
              "쉔", "쉬바나", "스웨인", "스카너", "시비르", "신드라", "신지드", "신짜오", "쓰레쉬", "아리", "아무무", "아우렐리온솔", "아이번", "아지르", "아칼리",
              "아크샨", "아트록스", "아펠리우스",
              "알리스타", "애니", "애니비아", "애쉬", "야스오", "에코", "엘리스", "오공", "오른", "오리아나", "올라프", "요네", "요릭", "우디르", "우르곳", "워윅",
              "유미", "이렐리아",
              "이블린", "이즈리얼", "일라오이", "자르반4세", "자야", "자이라", "자크", "잔나", "잭스", "제드", "제라스", "제리", "제이스", "조이", "직스", "진",
              "질리언", "징크스",
              "초가스", "카르마", "카밀", "카사딘", "카서스", "카시오페아", "카이사", "카직스", "카타리나", "칼리스타", "케넨", "케이틀린", "케인", "케일", "코그모",
              "코르키", "퀸", "클레드",
              "키아나", "킨드레드", "타릭", "탈론", "탈리야", "탐켄치", "트런들", "트리스타나", "트린다미어", "트위스티드페이트", "트위치", "티모", "파이크", "판테온",
              "피들스틱", "피오라", "피즈", "하이머딩거", "헤카림"]

G_CHAMPION_CHOSUNG = ["ㄱㄹ", "ㄱㄹㅇ", "ㄱㅍㄹㅋ", "ㄱㄹㄱㅅ", "ㄱㄹㅇㅂㅈ", "ㄱㅇ", "ㄴㄹ", "ㄴㅁ", "ㄴㅅㅅ", "ㄴㅌㄹㅅ", "ㄴㅌ", "ㄴㄴ", "ㄴㄷㄹ", "ㄴㅋ",
                      "ㄷㄹㅇㅅ",
                      "ㄷㅇㅇㄴ", "ㄷㄹㅇㅂ",
                      "ㄹㅇㅈ", "ㄹㅋ", "ㄹㅁㅅ", "ㄹㅅ", "ㄹㅂ", "ㄹㄴㅌㄹㅅㅋ", "ㄹㄴㅌ", "ㄹㅇㄴ", "ㄹㅅㅇ", "ㄹ", "ㄹㄱ", "ㄹㅅㅇ", "ㄹㄹ", "ㄹㅂㄹ",
                      "ㄹㅂ",
                      "ㄹㅅㄷㄹ", "ㄹㅅ", "ㄹㄹㅇ",
                      "ㅁㅅㅌㅇ", "ㅁㅇㅋㅇ", "ㅁㅈㅎ", "ㅁㅍㅇㅌ", "ㅁㄷㅋㅇㅈ", "ㅁㄹㄱㄴ", "ㅁㄷㅂㅅ", "ㅁㅅㅍㅊ", "ㅂㄷ", "ㅂㄹㅅ", "ㅂㅇ", "ㅂㅇㄱ", "ㅂㅇ",
                      "ㅂㅅ",
                      "ㅂㅋㅈ", "ㅂㄹㅂㅇ",
                      "ㅂㄹㅇ", "ㅂㄹㄷ", "ㅂㄹㄷㅁㄹ", "ㅂㄹㅊㅋㄹㅋ", "ㅂㅇㄱ", "ㅂㅌㄹ", "ㅃㅃ", "ㅅㅁㄹ", "ㅅㅇㅇ", "ㅅㅇㄹㅅ", "ㅅㅋ", "ㅅㄴ", "ㅅㄹㅍ",
                      "ㅅㅈㅇㄴ",
                      "ㅅㅌ", "ㅅㄴ", "ㅅㄹㅋ",
                      "ㅅ", "ㅅㅂㄴ", "ㅅㅇㅇ", "ㅅㅋㄴ", "ㅅㅂㄹ", "ㅅㄷㄹ", "ㅅㅈㄷ", "ㅅㅉㅇ", "ㅆㄹㅅ", "ㅇㄹ", "ㅇㅁㅁ", "ㅇㅇㄹㄹㅇㅅ", "ㅇㅇㅂ", "ㅇㅈㄹ",
                      "ㅇㅋㄹ",
                      "ㅇㅋㅅ", "ㅇㅌㄹㅅ", "ㅇㅍㄹㅇㅅ",
                      "ㅇㄹㅅㅌ", "ㅇㄴ", "ㅇㄴㅂㅇ", "ㅇㅅ", "ㅇㅅㅇ", "ㅇㅋ", "ㅇㄹㅅ", "ㅇㄱ", "ㅇㄹ", "ㅇㄹㅇㄴ", "ㅇㄹㅍ", "ㅇㄴ", "ㅇㄹ", "ㅇㄷㄹ",
                      "ㅇㄹㄱ", "ㅇㅇ",
                      "ㅇㅁ", "ㅇㄹㄹㅇ",
                      "ㅇㅂㄹ", "ㅇㅈㄹㅇ", "ㅇㄹㅇㅇ", "ㅈㄹㅂ4ㅅ", "ㅈㅇ", "ㅈㅇㄹ", "ㅈㅋ", "ㅈㄴ", "ㅈㅅ", "ㅈㄷ", "ㅈㄹㅅ", "ㅈㄹ", "ㅈㅇㅅ", "ㅈㅇ",
                      "ㅈㅅ", "ㅈ",
                      "ㅈㄹㅇ", "ㅈㅋㅅ",
                      "ㅊㄱㅅ", "ㅋㄹㅁ", "ㅋㅁ", "ㅋㅅㄷ", "ㅋㅅㅅ", "ㅋㅅㅇㅍㅇ", "ㅋㅇㅅ", "ㅋㅈㅅ", "ㅋㅌㄹㄴ", "ㅋㄹㅅㅌ", "ㅋㄴ", "ㅋㅇㅌㄹ", "ㅋㅇ", "ㅋㅇ",
                      "ㅋㄱㅁ",
                      "ㅋㄹㅋ", "ㅋ", "ㅋㄹㄷ",
                      "ㅋㅇㄴ", "ㅋㄷㄹㄷ", "ㅌㄹ", "ㅌㄹ", "ㅌㄹㅇ", "ㅌㅋㅊ", "ㅌㄹㄷ", "ㅌㄹㅅㅌㄴ", "ㅌㄹㄷㅁㅇ", "ㅌㅇㅅㅌㄷㅍㅇㅌ", "ㅌㅇㅊ", "ㅌㅁ", "ㅍㅇㅋ",
                      "ㅍㅌㅇ",
                      "ㅍㄷㅅㅌ", "ㅍㅇㄹ", "ㅍㅈ", "ㅎㅇㅁㄷㄱ", "ㅎㅋㄹ"]

G_CHAMPION_CLICKED = [False for i in range(len(G_CHAMPION))]

G_SHEET4_EXCEPT_STR = ["CHAMP", "게임시간"]

G_LOL_RANDOM_SPEECH = [
    "지피지기면 백전백승",
    "당신의 뜻대로, 싸우겠소.",
    "어디로 가야 하오.",
    "나의 검은 당신의 것이요",
    "항상 정신을 집중하세요.",
    "우리가 감내한 고통만큼, 우린 성장했습니다.",
    "그-래.",
    "죽음은 바람과 같지. 늘 내곁에 있으니.",
    "바위처럼 단단하게.",
    "더 배우고, 더 성장하고, 더 니코할 거야!",
    "겨뤄볼 만한 상대, 어디 없나?",
    "배신자에겐, 죽음뿐.",
    "우리의 숨이 멎으면 안식을 취할 것이니.",
    "니가 사는거라면 나도 끼지",
    "야생을 두려워하게 만들어주지",
    "새벽이 밝았습니다!",
    "일단 한대 맞아 질문은 나중에 하고.",
    "어디 한번 길을 밝혀보죠!",
    "어둠에 빠진 자들을 사냥 해볼까.",
    "세상을 불 태울 준비는 되었나?",
    "브라움만 믿으라구!",
    "시스템 가동 준비 완료.",
    "영광스러운 진화에 동참하라!",
    "해방이다",
    "내 숨이 붙어있는 한 고통 받게 두지않아요",
    "전장으로!",
    "우리 같이.. 홀려 볼까요?",
    "너랑 유미랑 우리 함께 잘 해보자고",
    "오늘 밤, 사냥을 나선다",
    "보이지않는 검이 가장 무서운법",
    "행운은 멍청이를 싫어하는 법이지",
    "바람의 힘을 마음껏 부리세요!",
]


def g_get_lol_random_speech_str():
    return G_LOL_RANDOM_SPEECH[random.randint(0, len(G_LOL_RANDOM_SPEECH) - 1)]


def g_clear_champion_clicked():
    for bl in range(len(G_CHAMPION_CLICKED)):
        G_CHAMPION_CLICKED[bl] = False


def g_convertToInitialLetters(text):
    CHOSUNG_START_LETTER = 4352
    JAMO_START_LETTER = 44032
    JAMO_END_LETTER = 55203
    JAMO_CYCLE = 588

    def isHangul(ch):
        return JAMO_START_LETTER <= ord(ch) <= JAMO_END_LETTER

    result = ""
    for ch in text:
        if isHangul(ch):  # 한글이 아닌 글자는 걸러냅니다.

            result += chr(int((ord(ch) - JAMO_START_LETTER) / JAMO_CYCLE + CHOSUNG_START_LETTER))
    return result
